oc2k/Pic18a/TCPIP/App/main.c
            DisplayIPValue(AppConfig.MyIPAddr);

            #if defined(STACK_USE_UART)
                putrsUART((ROM char*)"\r\n");
            #endif


            #if defined(STACK_USE_ANNOUNCE)
                AnnounceIP();
            #endif

            #if defined(STACK_USE_ZEROCONF_MDNS_SD)
                mDNSFillHostRecord();
            #endif

			#ifdef WIFI_NET_TEST	
			#ifdef STACK_USE_TFTP_CLIENT
			if(AppConfig.Flags.bIsDHCPEnabled && DHCPIsBound(0)) {	
				static UINT8  tftpInitDone = 0;
				static BYTE dummy_file[] = "TFTP test dummy contents";
				static ROM BYTE file_name[] = "dontcare";
				static ROM BYTE host_name[] = "tftp" WIFI_NET_TEST_DOMAIN;	
				if (!tftpInitDone) {
					TFTPUploadRAMFileToHost(host_name, file_name, dummy_file, sizeof(dummy_file));
					tftpInitDone = 1;
				}
			}
			#endif
			#endif
			
        }    
        #if defined(DERIVE_KEY_FROM_PASSPHRASE_IN_HOST) && defined (MRF24WG)
            if (g_WpsPassphrase.valid) {
                WF_ConvPassphrase2Key(g_WpsPassphrase.passphrase.keyLen, g_WpsPassphrase.passphrase.key,
                g_WpsPassphrase.passphrase.ssidLen, g_WpsPassphrase.passphrase.ssid);
                WF_SetPSK(g_WpsPassphrase.passphrase.key);
                g_WpsPassphrase.valid = FALSE;
            }
        #endif    /* defined(DERIVE_KEY_FROM_PASSPHRASE_IN_HOST) */
		#if defined(STACK_USE_AUTOUPDATE_HTTPSERVER) && defined(WF_CS_TRIS) && defined(MRF24WG)
		{
			static DWORD t_UpdateImage=0;
			extern UINT8 Flag_ImageUpdate_running;
			if(Flag_ImageUpdate_running == 1)
			{
				UINT8 buf_command[4];
				if( (TickGet() - t_UpdateImage) >= TICK_SECOND * 120ul)
				{
					putsUART((char *)"Update Firmware timeout, begin to restore..\r\n");
					buf_command[0]=UPDATE_CMD_ERASE0; //Erase bank0
					buf_command[1]=UPDATE_SERITY_KEY_1; 
					buf_command[2]=UPDATE_SERITY_KEY_2; 
					buf_command[3]=UPDATE_SERITY_KEY_3; 
					SendSetParamMsg(PARAM_FLASH_update, buf_command, 4);
					buf_command[0]=UPDATE_CMD_CPY_1TO0; //Copy bank1 to bank0
					buf_command[1]=UPDATE_SERITY_KEY_1; 
					buf_command[2]=UPDATE_SERITY_KEY_2; 
					buf_command[3]=UPDATE_SERITY_KEY_3; 
					SendSetParamMsg(PARAM_FLASH_update, buf_command, 4);
					putsUART((char *)"restore Done\r\n");
					Flag_ImageUpdate_running = 0;
				}
					
			}
			else
			{
				t_UpdateImage = TickGet();
			}
		}
		#endif
    }
}

#if defined(WF_CS_TRIS)

/*****************************************************************************
 * FUNCTION: WF_Connect
 *
 * RETURNS:  None
 *
 * PARAMS:   None
 *
 *  NOTES:   Connects to an 802.11 network.  Customize this function as needed 
 *           for your application.
 *****************************************************************************/
void WF_Connect(void)
{
    UINT8 channelList[] = MY_DEFAULT_CHANNEL_LIST;
 
    /* create a Connection Profile */
    WF_CPCreate(&ConnectionProfileID);
    
    WF_SetRegionalDomain(MY_DEFAULT_DOMAIN);  

    WF_CPSetSsid(ConnectionProfileID, 
                 AppConfig.MySSID, 
                 AppConfig.SsidLength);
    
    WF_CPSetNetworkType(ConnectionProfileID, MY_DEFAULT_NETWORK_TYPE);
    
    WF_CASetScanType(MY_DEFAULT_SCAN_TYPE);
    
    
    WF_CASetChannelList(channelList, sizeof(channelList));
    
    // The Retry Count parameter tells the WiFi Connection manager how many attempts to make when trying
    // to connect to an existing network.  In the Infrastructure case, the default is to retry forever so that
    // if the AP is turned off or out of range, the radio will continue to attempt a connection until the
    // AP is eventually back on or in range.  In the Adhoc case, the default is to retry 3 times since the 
    // purpose of attempting to establish a network in the Adhoc case is only to verify that one does not
    // initially exist.  If the retry count was set to WF_RETRY_FOREVER in the AdHoc mode, an AdHoc network
    // would never be established. 
    WF_CASetListRetryCount(MY_DEFAULT_LIST_RETRY_COUNT);

    WF_CASetEventNotificationAction(MY_DEFAULT_EVENT_NOTIFICATION_LIST);
    
    WF_CASetBeaconTimeout(MY_DEFAULT_BEACON_TIMEOUT);
    
    #if !defined(MRF24WG)
        if (gRFModuleVer1209orLater)
    #else
        {
            // If WEP security is used, set WEP Key Type.  The default WEP Key Type is Shared Key.
            if (AppConfig.SecurityMode == WF_SECURITY_WEP_40 || AppConfig.SecurityMode == WF_SECURITY_WEP_104)
            {
                WF_CPSetWepKeyType(ConnectionProfileID, MY_DEFAULT_WIFI_SECURITY_WEP_KEYTYPE);
            }
        }    
    #endif
            
    #if defined(MRF24WG)
        // Error check items specific to WPS Push Button mode 
        #if (MY_DEFAULT_WIFI_SECURITY_MODE==WF_SECURITY_WPS_PUSH_BUTTON)
            #if !defined(WF_P2P)
                WF_ASSERT(strlen(AppConfig.MySSID) == 0);  // SSID must be empty when using WPS
                WF_ASSERT(sizeof(channelList)==11);        // must scan all channels for WPS       
            #endif

             #if (MY_DEFAULT_NETWORK_TYPE == WF_P2P)
                WF_ASSERT(strcmp((char *)AppConfig.MySSID, "DIRECT-") == 0);
                WF_ASSERT(sizeof(channelList) == 3);
                WF_ASSERT(channelList[0] == 1);
                WF_ASSERT(channelList[1] == 6);
                WF_ASSERT(channelList[2] == 11);           
            #endif
        #endif    

    #endif /* MRF24WG */

    #if defined(DERIVE_KEY_FROM_PASSPHRASE_IN_HOST)
        if (AppConfig.SecurityMode == WF_SECURITY_WPA_WITH_PASS_PHRASE
            || AppConfig.SecurityMode == WF_SECURITY_WPA2_WITH_PASS_PHRASE
            || AppConfig.SecurityMode == WF_SECURITY_WPA_AUTO_WITH_PASS_PHRASE) {
            WF_ConvPassphrase2Key(AppConfig.SecurityKeyLength, AppConfig.SecurityKey,
                AppConfig.SsidLength, AppConfig.MySSID);
            AppConfig.SecurityMode--;
            AppConfig.SecurityKeyLength = 32;
        }
    #if defined (MRF24WG)
        else if (AppConfig.SecurityMode == WF_SECURITY_WPS_PUSH_BUTTON
                    || AppConfig.SecurityMode == WF_SECURITY_WPS_PIN) {
            WF_YieldPassphrase2Host();    
        }
    #endif    /* defined (MRF24WG) */
    #endif    /* defined(DERIVE_KEY_FROM_PASSPHRASE_IN_HOST) */
		#if !defined(MRF24WG)	
		Delay10us(10);  //give time to Roadrunner to clean message buffer, because Security message is a big data package
		#endif
    WF_CPSetSecurity(ConnectionProfileID,
                     AppConfig.SecurityMode,
                     AppConfig.WepKeyIndex,   /* only used if WEP enabled */
                     AppConfig.SecurityKey,
                     AppConfig.SecurityKeyLength);

